lib/tasks/movieitem.rake

task fetch: :environment do
  response = open("https://api.themoviedb.org/3/trending/movie/week?api_key=f3e3540940d267810c211e8fafd2edc2").read
  data = JSON.parse(response)
  films  = data['results'].map {|rd| MovieItemForFun.new(rd['adult'], rd['backdrop_path'], rd['original_language'], rd['original_title'], rd['poster_path'], rd['release_date'], rd['title'])}
  films.each do |article|
    MovieItem.create(
      adult: article.adult,
      backdrop_path: article.backdrop_path,
      original_language: article.original_language,
      original_title: article.original_title,
      poster_path: article.poster_path,
      release_date: article.release_date,
      title: article.title
    )
---
INSERT INTO "movie_items" ("adult", "backdrop_path", "original_language", "original_title", "poster_path", "release_date", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"