app/controllers/movies_controller.rb

    def movie_item_collection
      MovieItem.all
---
SELECT "movie_items".* FROM "movie_items"