app/controllers/movies_find_controller.rb

SELECT "movie_items".* FROM "movie_items" WHERE (LOWER(title) ILIKE '%ss%')
---
    def movie_item_collection
      MovieItem.where("LOWER(title) ILIKE '%#{params[:query].downcase}%'")